dict = {
    "а": 0, "б": 0, "в": 0, "г": 0, "д": 0, "е": 0, "ё": 0, "ж": 0, "з": 0, "и": 0, "й": 0,
    "к": 0, "л": 0, "м": 0, "н": 0, "о": 0, "п": 0, "р": 0, "с": 0, "т": 0, "у": 0, "ф": 0,
    "х": 0, "ц": 0, "ч": 0, "ш": 0, "щ": 0, "ъ": 0, "ы": 0, "ь": 0, "э": 0, "ю": 0, "я": 0,

    "a": 0, "b": 0, "c": 0, "d": 0, "e": 0, "f": 0, "g": 0, "h": 0, "i": 0, "j": 0, "k": 0,
    "l": 0, "m": 0, "n": 0, "o": 0, "p": 0, "q": 0, "r": 0, "s": 0, "t": 0, "u": 0, "v": 0,
    "w": 0, "x": 0, "y": 0, "z": 0,
}

main_str = """
    Данное предложение будет разбиваться на отдельные слова. 
    В качестве разделителя для встроенного метода split будет выбран символ пробела. На выходе мы получим список отдельных слов. 
    Далее нужно отсортировать слова в алфавитном порядке, а после сортировки склеить их с помощью метода строк join. Приступим!!!!
"""

def get_count_char(str_):
    newstr = str_.lower().replace(" ", "")
    str_length = len(newstr)
    for i in newstr:
        if i.isalpha():
            dict[i] += 1
    return dict
print("1. словарь с частотой каждого символа:\n", get_count_char(main_str))


def get_percent(dict_, str_):
    newstr = str_.lower().replace(" ", "")
    str_length = len(newstr)
    for k, v in dict_.items():
        dict_[k] = round((v * 100)/str_length, 3)
    return dict_

print("2. словарь с процентным соотношением:\n", get_percent(dict, main_str))
